Ejercicio Seminario: Uso de Pipelines en ML

In [ ]:
'''# prompt: mount drive y crear path para sys y para directorio de trabajo

from google.colab import drive
drive.mount('/content/drive')

import sys
import os

# Define the path to your working directory in Google Drive
path = "/content/drive/My Drive/cod/LEA3_Seminario"  # Replace with your actual directory


sys.path.append(path) ### para importar archivo de funciones propias a trav√©s de import

os.chdir(path) ### para que por defecto suba y descargue archivos partiendo de esa ruta
'''

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [1]:
import pandas as pd

In [9]:
df_read = 'https://raw.githubusercontent.com/mateotl/LEA3_Seminario/6c97255963fc9d1f001fb3e74aaaef7762cbc2cf/aug_test.csv'
df = pd.read_csv(df_read, sep = ',')

In [10]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,32403,city_41,0.827,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,NaN,1,21
1,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98
2,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,10/49,Pvt Ltd,1,39
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72